# Задача 1.
# Найдите сумму двух чисел.

# # 1. Вариант (лёгкий).
# a = int(input('Введите a: '))
# b = int(input('Введите b: '))
# print(f'{a} + {b} = {a + b}')

# # 2. Вариант (средний).
# a = int(input('Введите a: '))
# b = int(input('Введите b: '))
# def sum(a, b):
#     return a + b
# print(f'{a} + {b} = {sum(a, b)}')

# # 2. Вариант (сложный).
# a = int(input('Введите a: '))
# b = int(input('Введите b: '))
# sum = lambda x, y: a + b
# print(f'{a} + {b} = {sum(a, b)}')


# # Задача 2.
# # Создайте кнопочный калькулятор составленный из модулей.


# # Задача 3.
# # Система собирает информацию с датчиков, в ней есть
# # модуль логирования, который заносит в журнал все
# # обращения к датчикам.
# # В системе есть модуль, выполняющий обращения для
# # получения данных с датчиков и модуль генерации html
# # представления.
# # Запуск системы осуществляется из головного модуля.



# # Задача 4.
# # Есть файл, состоящий из N тысяч строк содержащих
# # информацию о неких пользователях.
# # Предлагаемые поля: id, имя, фамилия, день
# # рождения, место работы,
# # номер телефона (может быть несколько).
# # В качестве символа разделителя
# # использовать пустую строку.
